/*
 * 1. Двусвязный список
 *  Требуется реализовать класс двусвязного списка и операции: 
 * - вставки, 
 * - удаления 
 *          и 
 * - поиска элемента в нём в соответствии с интерфейсом.

2. Двоичный поиск
Требуется написать функцию бинарного поиска, посчитать его асимптотическую сложность и проверить работоспособность функции.



*/
using System;

namespace Part_Q2_lesson_002
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");

             
        }
    }
}
